app/controllers/posts_controller.rb

    def create
      @post = Post.new(content: params[:content], user_id: @current_user.id)
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "aa"], ["created_at", "2020-09-19 03:31:37.789576"], ["updated_at", "2020-09-19 03:31:37.789576"]]

    def update
      @post = Post.find_by(id:params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]